# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv8 with motion cross-attention for video object detection (2 injection points: P3, P4 only).
#
# Speed-comparison variant of yolov8-motion.yaml: drops the P5 cross-attention block entirely
# (fewer params, one less MotionCrossAttention forward/backward, no stride-x32 encoder stage needed).
# See yolov8-motion.yaml for the full architecture overview and rationale for dropping P5.
#
# Usage
# -----
#   from ultralytics.models.yolo.motion.train import MotionDetectionTrainer
#   trainer = MotionDetectionTrainer(overrides=dict(model="yolov8s-motion-2attn.yaml", data="coco8.yaml", epochs=100))
#   trainer.train()

nc: 80  # number of classes
scales:
  # [depth_multiple, width_multiple, max_channels]
  n: [0.33, 0.25, 1024]  # nano
  s: [0.33, 0.50, 1024]  # small
  m: [0.67, 0.75, 768]   # medium
  l: [1.00, 1.00, 512]   # large
  x: [1.00, 1.25, 512]   # xlarge

# ──────────────────────────────────────────────────────────────────────
# Motion stream configuration  (MotionDetectionModel reads this section)
# ──────────────────────────────────────────────────────────────────────
motion:
  channels: 3               # motion diff input channels (3 for RGB absolute diff)
  dims: [32, 64, 128, 256]  # MotionEncoder output channels at each stride (x2, x4, x8, x16) - no x32
  #                           stage since there is no P5 injection point to feed.
  inject_layers: [4, 6]  # backbone layer indices to fuse motion after (P3, P4 only - no P5)
  motion_feat_scales: [2, 3]
  # ^ Which MotionEncoder output stage (0-indexed) to feed each inject point (both exact matches):
  #   inject_layers[0]=4 (P3, stride 8)  → dims[2]=128  (stride x8)
  #   inject_layers[1]=6 (P4, stride 16) → dims[3]=256  (stride x16)

# ──────────────────────────────────────────────────────────────────────
# YOLOv8 backbone  (current frame only – identical to yolov8.yaml)
# ──────────────────────────────────────────────────────────────────────
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C2f, [128, True]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 6, C2f, [256, True]]    # 4  ← MotionCrossAttention injected here (P3)
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f, [512, True]]    # 6  ← MotionCrossAttention injected here (P4)
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]   # 8
  - [-1, 1, SPPF, [1024, 5]]     # 9  (no motion injection - P5 dropped in this variant)

# ──────────────────────────────────────────────────────────────────────
# YOLOv8 head  (identical to yolov8.yaml)
# ──────────────────────────────────────────────────────────────────────
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]   # cat backbone P4
  - [-1, 3, C2f, [512]]         # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]   # cat backbone P3
  - [-1, 3, C2f, [256]]         # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]         # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]   # cat head P5
  - [-1, 3, C2f, [1024]]        # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]
