# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLO26 with motion cross-attention for video object detection (3 injection points: P3, P4, P5).
#
# Overview
# --------
# This model receives TWO aligned images per sample:
#   1. current frame  – standard RGB image (batch["img"])
#   2. motion diff    – absolute pixel-wise difference between current and previous frame (batch["motion"])
#
# A lightweight MotionEncoder extracts multi-scale features from the motion image.
# MotionCrossAttention modules fuse those features into the backbone at P3, P4, and P5.
# A learned gate (initialised to 0) ensures no-op at init; the cross-attention activates
# gradually as training progresses.
#
# The 'motion:' section below is consumed by MotionDetectionModel and is ignored by parse_model.
# Backbone/head below are otherwise identical to yolo26.yaml (C3k2 blocks, SPPF, C2PSA, end-to-end
# NMS-free Detect head) — only the injected cross-attention differs from that base model.
#
# Dataset convention
# ------------------
#   images/train/<name>.jpg  – current frame
#   motion/train/<name>.jpg  – motion diff (same filename)
#   labels/train/<name>.txt  – YOLO labels (unchanged)
#
# Usage
# -----
#   from ultralytics.models.yolo.motion.train import MotionDetectionTrainer
#   trainer = MotionDetectionTrainer(overrides=dict(model="yolo26s-motion.yaml", data="coco8.yaml", epochs=100))
#   trainer.train()

nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26s-motion.yaml' will call this file with scale 's'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ──────────────────────────────────────────────────────────────────────
# Motion stream configuration  (MotionDetectionModel reads this section)
# ──────────────────────────────────────────────────────────────────────
motion:
  channels: 3                    # motion diff input channels (3 for RGB absolute diff)
  dims: [32, 64, 128, 256, 256]  # MotionEncoder output channels at each stride (x2, x4, x8, x16, x32)
  inject_layers: [4, 6, 10]  # backbone layer indices to fuse motion after (P3, P4, P5+SPPF+C2PSA)
  motion_feat_scales: [2, 3, 4]
  # ^ Which MotionEncoder output stage (0-indexed) to feed each inject point. A dedicated stride-x32
  #   stage (dims[4]) feeds P5 natively so no injection point needs a forced bilinear resize:
  #   inject_layers[0]=4  (P3, stride 8)  → dims[2]=128  (stride x8,  exact match)
  #   inject_layers[1]=6  (P4, stride 16) → dims[3]=256  (stride x16, exact match)
  #   inject_layers[2]=10 (P5, stride 32) → dims[4]=256  (stride x32, exact match)
  #   Note: layer 10 is C2PSA (after SPPF at 9) — one index later than yolov8-motion's P5 tap (SPPF=9),
  #   since YOLO26's backbone adds a C2PSA block after SPPF.

# ──────────────────────────────────────────────────────────────────────
# YOLO26 backbone  (current frame only – identical to yolo26.yaml)
# ──────────────────────────────────────────────────────────────────────
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4  ← MotionCrossAttention injected here (P3)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6  ← MotionCrossAttention injected here (P4)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10  ← MotionCrossAttention injected here (P5)

# ──────────────────────────────────────────────────────────────────────
# YOLO26 head  (identical to yolo26.yaml)
# ──────────────────────────────────────────────────────────────────────
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
