# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLO26 with motion cross-attention, using spatial-reduction attention (SRA) at the P3 tap.
#
# Same 3 injection points as yolo26-motion.yaml (P3, P4, P5), but the P3 cross-attention pools its
# K/V (motion) side by 4x before computing attention. Full dense attention is O((H*W)^2) in tokens,
# and P3 is by far the highest-resolution tap (52x52=2704 tokens at imgsz 416, vs 676 at P4 and 169
# at P5) - benchmarking showed P3's quadratic attention cost dominates wall-clock latency far more
# than its FLOP count suggests (memory-bandwidth bound reshape/softmax/matmul chain), while dropping
# P5 entirely (see yolo26-motion-2attn.yaml) barely changed latency at all. Queries stay at full P3
# resolution so the output feature map keeps full spatial fidelity; only the motion keys/values are
# coarsened, which is reasonable since motion is typically smoother/lower-frequency than appearance.
#
# See yolo26-motion.yaml for the full architecture overview.
#
# Usage
# -----
#   from ultralytics.models.yolo.motion.train import MotionDetectionTrainer
#   trainer = MotionDetectionTrainer(overrides=dict(model="yolo26s-motion-p3sr.yaml", data="coco8.yaml", epochs=100))
#   trainer.train()

nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26s-motion-p3sr.yaml' will call this file with scale 's'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ──────────────────────────────────────────────────────────────────────
# Motion stream configuration  (MotionDetectionModel reads this section)
# ──────────────────────────────────────────────────────────────────────
motion:
  channels: 3                    # motion diff input channels (3 for RGB absolute diff)
  dims: [32, 64, 128, 256, 256]  # MotionEncoder output channels at each stride (x2, x4, x8, x16, x32)
  inject_layers: [4, 6, 10]  # backbone layer indices to fuse motion after (P3, P4, P5+SPPF+C2PSA)
  motion_feat_scales: [2, 3, 4]
  sr_ratios: [4, 1, 1]
  # ^ K/V spatial-reduction ratio per inject point: P3's motion K/V is 4x4-avg-pooled before
  #   attention (2704 -> 169 K/V tokens at imgsz 416), P4/P5 stay full dense (already cheap).

# ──────────────────────────────────────────────────────────────────────
# YOLO26 backbone  (current frame only – identical to yolo26.yaml)
# ──────────────────────────────────────────────────────────────────────
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4  ← MotionCrossAttention injected here (P3, sr_ratio=4)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6  ← MotionCrossAttention injected here (P4)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10  ← MotionCrossAttention injected here (P5)

# ──────────────────────────────────────────────────────────────────────
# YOLO26 head  (identical to yolo26.yaml)
# ──────────────────────────────────────────────────────────────────────
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
