# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLO26 with motion cross-attention for video object detection (2 injection points: P3, P4 only).
#
# Speed-comparison variant of yolo26-motion.yaml: drops the P5 cross-attention block entirely
# (fewer params, one less MotionCrossAttention forward/backward, no stride-x32 encoder stage needed).
# P5 was also the injection point most starved for gradient signal against a converged pretrained
# backbone, and AOT-sized small objects carry most of their signal at P3/P4 anyway, so this is a
# reasonable place to cut for a speed/quality trade-off comparison against the 3-layer version.
#
# Same TWO-image convention as yolo26-motion.yaml (batch["img"] + batch["motion"]); see that file
# for the full architecture overview.
#
# Usage
# -----
#   from ultralytics.models.yolo.motion.train import MotionDetectionTrainer
#   trainer = MotionDetectionTrainer(overrides=dict(model="yolo26s-motion-2attn.yaml", data="coco8.yaml", epochs=100))
#   trainer.train()

nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26s-motion-2attn.yaml' will call this file with scale 's'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ──────────────────────────────────────────────────────────────────────
# Motion stream configuration  (MotionDetectionModel reads this section)
# ──────────────────────────────────────────────────────────────────────
motion:
  channels: 3               # motion diff input channels (3 for RGB absolute diff)
  dims: [32, 64, 128, 256]  # MotionEncoder output channels at each stride (x2, x4, x8, x16) - no x32
  #                           stage since there is no P5 injection point to feed.
  inject_layers: [4, 6]  # backbone layer indices to fuse motion after (P3, P4 only - no P5)
  motion_feat_scales: [2, 3]
  # ^ Which MotionEncoder output stage (0-indexed) to feed each inject point (both exact matches):
  #   inject_layers[0]=4 (P3, stride 8)  → dims[2]=128  (stride x8)
  #   inject_layers[1]=6 (P4, stride 16) → dims[3]=256  (stride x16)

# ──────────────────────────────────────────────────────────────────────
# YOLO26 backbone  (current frame only – identical to yolo26.yaml)
# ──────────────────────────────────────────────────────────────────────
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4  ← MotionCrossAttention injected here (P3)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6  ← MotionCrossAttention injected here (P4)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10  (no motion injection - P5 dropped in this variant)

# ──────────────────────────────────────────────────────────────────────
# YOLO26 head  (identical to yolo26.yaml)
# ──────────────────────────────────────────────────────────────────────
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
